app/views/businesses/show.html.erb

SELECT  "deals".* FROM "deals" WHERE "deals"."id" = $1 LIMIT 1  [["id", nil]]
---
        <% @accepted_deals.each do |deal| %>
          <% temp = Deal.find(deal.deal_id) %>

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", nil]]
---
              <div class="accepted-deal-info span_6_of_12">
                <p class="deal-title">Customer name: <%= Customer.find(deal.customer_id).first_name%></p>