app/controllers/businesses_controller.rb

SELECT "customer_deals".* FROM "customer_deals"
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1  ORDER BY "businesses"."id" ASC LIMIT 1  [["id", 1]]
---
 def show
  viewed_business
  business_deals = Deal.where(business_id: params[:id])
  @mass_deal = []
  business_deals.each do |deal|
    CustomerDeal.where(deal_id: deal.id).each do |deals|
      if deals.mass_deal
        @mass_deal << deals
      end
    end
  end

  @array_of_requests=[]
  CustomerDeal.all.each do |deal|
    temp = Deal.find(deal.deal_id)
    if Business.find(params[:id]).neighborhood == deal.neighborhood