app/controllers/businesses_controller.rb

  def show
    authenticate_current_business
    viewed_business
    business_deals = Deal.where(business_id: params[:id])
    @mass_deal = []
    business_deals.each do |deal|
      CustomerDeal.where(deal_id: deal.id).each do |deals|
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = $1  [["business_id", 1]]
SELECT  "deals".* FROM "deals" WHERE "deals"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "customer_deals".* FROM "customer_deals" WHERE "customer_deals"."deal_id" = $1  [["deal_id", 1]]

  def request_list
    @business = Business.find(params[:business_id])
    @requests=[]
    CustomerDeal.all.each do |deal|
      business_neighborhoods = JSON.parse(@business.neighborhoods).map { |e| e.downcase }
        if deal.neighborhoods != nil
          if((business_neighborhoods.include?(deal.neighborhoods.downcase)) && (deal.deal_id==nil))
            name_customer = Customer.find(deal.customer_id).first_name
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "customer_deals".* FROM "customer_deals"
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", 1]]

  def mass_deal
    @deals = Deal.where(business_id: params[:business_id])
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = $1  [["business_id", 1]]