app/controllers/customer_deals_controller.rb

  def create
    @new_customer_deal = CustomerDeal.create(customer_id: current_customer.id, party_size: params[:party_size], reservation_time: params[:reservation_time], neighborhoods: params[:neighborhoods])
---
INSERT INTO "customer_deals" ("customer_id", "party_size", "reservation_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["customer_id", 1], ["party_size", 1], ["reservation_time", "5:00 AM"], ["created_at", "2015-04-19 04:00:05.230781"], ["updated_at", "2015-04-19 04:00:05.230781"]]