app/controllers/deals_controller.rb

  def index
    # @deals = Business.find(params[:business_id]).deals.order(created_at: :asc).reverse()
    # render :json => @deals
    @deals = Business.find(params[:business_id]).deals.order(created_at: :asc).reverse()
    p 't'*90
    newarray=[]
    @deals.each do |h|
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = $1  ORDER BY "deals"."created_at" ASC  [["business_id", 1]]
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]

  def show
     @deals = Business.find(params[:business_id]).deals.order(created_at: :asc).reverse()
    p 't'*90
    newarray=[]
    @deals.each do |h|
---
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = $1  ORDER BY "deals"."created_at" ASC  [["business_id", 1]]
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @business = Business.find(params[:business_id])
    newdeal = Deal.create(name: params[:title], short_description: params[:content], deal_image: params[:image])
    @business.deals << newdeal
    @deals = Business.find(params[:business_id]).deals.order(created_at: :asc).reverse()
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "deals" ("name", "short_description", "deal_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "deals".* FROM "deals" WHERE "deals"."business_id" = $1  ORDER BY "deals"."created_at" ASC  [["business_id", 1]]

  def update
    @deal = Deal.find(params[:id])
    @deal.update_attributes(name: params[:title], short_description: params[:edit_content], deal_image: params[:image])
---
SELECT  "deals".* FROM "deals" WHERE "deals"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "deals" SET "name" = $1, "short_description" = $2, "updated_at" = $3 WHERE "deals"."id" = $4  [["name", "appleyyyy"], ["short_description", "many applesyyy"], ["updated_at", "2015-04-19 23:28:36.854336"], ["id", 7]]

  def destroy
    @deal = Deal.find(params[:id])
    id = @deal.id
    @deal.destroy
---
SELECT  "deals".* FROM "deals" WHERE "deals"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "deals" WHERE "deals"."id" = $1  [["id", 2]]